## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 1 to change, 5 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.api will be destroyed
  - resource "aws_iam_policy" "api" {
      - arn       = "arn:aws:iam::806545929748:policy/scan-files-api" -> null
      - id        = "arn:aws:iam::806545929748:policy/scan-files-api" -> null
      - name      = "scan-files-api" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:806545929748:log-group:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:Put*",
                          - "s3:ListBucketVersions",
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                          - "s3:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::scan-files-production-file-queue/*",
                          - "arn:aws:s3:::scan-files-production-file-queue",
                          - "arn:aws:s3:::scan-files-production-clamav-defs/*",
                          - "arn:aws:s3:::scan-files-production-clamav-defs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "states:StopExecution",
                          - "states:ListStateMachines",
                          - "states:ListActivities",
                          - "states:DescribeExecution",
                          - "states:CreateActivity",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:806545929748:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:806545929748:stateMachine:assemblyline-file-scan-queue"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:806545929748:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ca-central-1:806545929748:table/scan-locktable",
                          - "arn:aws:dynamodb:ca-central-1:806545929748:table/completed-scans",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:806545929748:parameter/scan-files/api_auth_token",
                          - "arn:aws:ssm:ca-central-1:806545929748:parameter/ENVIRONMENT_VARIABLES",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA3XSPCGYKE42X44TTT" -> null
      - tags      = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all  = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_iam_policy.api_assume_cross_account will be destroyed
  - resource "aws_iam_policy" "api_assume_cross_account" {
      - arn         = "arn:aws:iam::806545929748:policy/scan-files-api-assume-cross-account" -> null
      - description = "" -> null
      - id          = "arn:aws:iam::806545929748:policy/scan-files-api-assume-cross-account" -> null
      - name        = "scan-files-api-assume-cross-account" -> null
      - path        = "/" -> null
      - policy      = (sensitive) -> null
      - policy_id   = "ANPA3XSPCGYKKNT5AV6FG" -> null
      - tags        = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all    = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_iam_role.api will be destroyed
  - resource "aws_iam_role" "api" {
      - arn                   = "arn:aws:iam::806545929748:role/scan-files-api" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-11-15T16:54:38Z" -> null
      - force_detach_policies = false -> null
      - id                    = "scan-files-api" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::806545929748:policy/scan-files-api",
          - "arn:aws:iam::806545929748:policy/scan-files-api-assume-cross-account",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "scan-files-api" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROA3XSPCGYKE5JF7OYWJ" -> null

      - inline_policy {}
    }

  # aws_iam_role_policy_attachment.api will be destroyed
  - resource "aws_iam_role_policy_attachment" "api" {
      - id         = "scan-files-api-20211115165439832900000004" -> null
      - policy_arn = "arn:aws:iam::806545929748:policy/scan-files-api" -> null
      - role       = "scan-files-api" -> null
    }

  # aws_iam_role_policy_attachment.api_assume_cross_account will be destroyed
  - resource "aws_iam_role_policy_attachment" "api_assume_cross_account" {
      - id         = "scan-files-api-20220621141656322000000001" -> null
      - policy_arn = "arn:aws:iam::806545929748:policy/scan-files-api-assume-cross-account" -> null
      - role       = "scan-files-api" -> null
    }

  # module.api.aws_iam_policy.policies[1] will be created
  + resource "aws_iam_policy" "policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "api-1"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # module.api.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                        Sid       = ""
                    },
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::806545929748:root"
                        }
                      - Sid       = ""
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        id                    = "api"
        name                  = "api"
        tags                  = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role_policy_attachment.attachments[1] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "api"
    }

Plan: 2 to add, 1 to change, 5 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 21 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
